<a href="https://colab.research.google.com/github/Ganapathi-tech/python-programming/blob/main/pandas7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
india = pd.read_csv("india.csv")

In [ ]:
india

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021         35      0         -3         0
1  02 Feb 2021       1111     38         35        35
2  03 Feb 2021         38     35         30        -3
3  04 Feb 2021         30      1         30         0
4  05 Feb 2021          0     40        442        -5
5  06 Feb 2021         35     -5          0        30

In [ ]:
india.replace([1111, 0, 1, -5,-3,442, 30,35 ], np.nan)

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021        NaN    NaN        NaN       NaN
1  02 Feb 2021        NaN   38.0        NaN       NaN
2  03 Feb 2021       38.0    NaN        NaN       NaN
3  04 Feb 2021        NaN    NaN        NaN       NaN
4  05 Feb 2021        NaN   40.0        NaN       NaN
5  06 Feb 2021        NaN    NaN        NaN       NaN

In [ ]:
india = india.replace({"Hyderabad" : [1111, 0],
               "Delhi" : [0,-5,1],
               "Bangalore" : [-3, 442, 0],
               "Srinagar" : [35,30]}, np.nan)

In [ ]:
india

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0    NaN        NaN       0.0
1  02 Feb 2021        NaN   38.0       35.0       NaN
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0    NaN       30.0       0.0
4  05 Feb 2021        NaN   40.0        NaN      -5.0
5  06 Feb 2021       35.0    NaN        NaN       NaN

In [ ]:
import pandas as pd

In [ ]:
sp_df = pd.read_csv("speed.csv")

In [ ]:
sp_df

          Date     Speed Daytype
0  01 Feb 2021   90 kmph   Rainy
1  02 Feb 2021  120 kmph     Sun
2  03 Feb 2021  110 kmph     Sun
3  04 Feb 2021   80 kmph    Cold
4  05 Feb 2021   90 kmph    Cold
5  06 Feb 2021  100 kmph     Sun
6  07 Feb 2021   87 kmph   Rainy
7  08 Feb 2021  122 kmph     Sun
8  09 Feb 2021   82 kmph    Cold

In [ ]:
sp_df["Speed"]

0     90 kmph
1    120 kmph
2    110 kmph
3     80 kmph
4     90 kmph
5    100 kmph
6     87 kmph
7    122 kmph
8     82 kmph
Name: Speed, dtype: object

In [ ]:
sp_df["Speed"]

0     90 kmph
1    120 kmph
2    110 kmph
3     80 kmph
4     90 kmph
5    100 kmph
6     87 kmph
7    122 kmph
8     82 kmph
Name: Speed, dtype: object

In [ ]:
sp_df

          Date     Speed Daytype
0  01 Feb 2021   90 kmph   Rainy
1  02 Feb 2021  120 kmph     Sun
2  03 Feb 2021  110 kmph     Sun
3  04 Feb 2021   80 kmph    Cold
4  05 Feb 2021   90 kmph    Cold
5  06 Feb 2021  100 kmph     Sun
6  07 Feb 2021   87 kmph   Rainy
7  08 Feb 2021  122 kmph     Sun
8  09 Feb 2021   82 kmph    Cold

In [ ]:
sp_df.replace("Rainy", "rain")

          Date  Speed Daytype
0  01 Feb 2021     90    rain
1  02 Feb 2021    120     Sun
2  03 Feb 2021    110     Sun
3  04 Feb 2021     80    Cold
4  05 Feb 2021     90    Cold
5  06 Feb 2021    100     Sun
6  07 Feb 2021     87    rain
7  08 Feb 2021    122     Sun
8  09 Feb 2021     82    Cold

In [ ]:
sp_df.replace("kmph", "")

          Date     Speed Daytype
0  01 Feb 2021   90 kmph   Rainy
1  02 Feb 2021  120 kmph     Sun
2  03 Feb 2021  110 kmph     Sun
3  04 Feb 2021   80 kmph    Cold
4  05 Feb 2021   90 kmph    Cold
5  06 Feb 2021  100 kmph     Sun
6  07 Feb 2021   87 kmph   Rainy
7  08 Feb 2021  122 kmph     Sun
8  09 Feb 2021   82 kmph    Cold

In [ ]:
sp_df.replace("[A-Za-z]", "", regex = True)

       Date Speed Daytype
0  01  2021   90
1  02  2021  120
2  03  2021  110
3  04  2021   80
4  05  2021   90
5  06  2021  100
6  07  2021   87
7  08  2021  122
8  09  2021   82

In [ ]:
sp_df = sp_df.replace({"Speed" : "[A-Za-z]"}, "", regex = True )

In [ ]:
sp_df

          Date Speed Daytype
0  01 Feb 2021   90    Rainy
1  02 Feb 2021  120      Sun
2  03 Feb 2021  110      Sun
3  04 Feb 2021   80     Cold
4  05 Feb 2021   90     Cold
5  06 Feb 2021  100      Sun
6  07 Feb 2021   87    Rainy
7  08 Feb 2021  122      Sun
8  09 Feb 2021   82     Cold

In [ ]:
for i in range(len(sp_df)):
    sp_df["Speed"][i] = int(sp_df["Speed"][i])

In [ ]:
sp_df["Speed"]

0     90
1    120
2    110
3     80
4     90
5    100
6     87
7    122
8     82
Name: Speed, dtype: object

In [ ]:
sp_df["Speed"].sum()

881

In [ ]:
sp_df["Speed"].mean()

97.88888888888889

In [ ]:
india

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0    NaN        NaN       0.0
1  02 Feb 2021        NaN   38.0       35.0       NaN
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0    NaN       30.0       0.0
4  05 Feb 2021        NaN   40.0        NaN      -5.0
5  06 Feb 2021       35.0    NaN        NaN       NaN

In [ ]:
india.replace(p.nan, 35 )n

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0   35.0       35.0       0.0
1  02 Feb 2021       35.0   38.0       35.0      35.0
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0   35.0       30.0       0.0
4  05 Feb 2021       35.0   40.0       35.0      -5.0
5  06 Feb 2021       35.0   35.0       35.0      35.0

In [ ]:
india

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0    NaN        NaN       0.0
1  02 Feb 2021        NaN   38.0       35.0       NaN
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0    NaN       30.0       0.0
4  05 Feb 2021        NaN   40.0        NaN      -5.0
5  06 Feb 2021       35.0    NaN        NaN       NaN

In [ ]:
india.fillna(30)

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0   30.0       30.0       0.0
1  02 Feb 2021       30.0   38.0       35.0      30.0
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0   30.0       30.0       0.0
4  05 Feb 2021       30.0   40.0       30.0      -5.0
5  06 Feb 2021       35.0   30.0       30.0      30.0

In [ ]:
india

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0    NaN        NaN       0.0
1  02 Feb 2021        NaN   38.0       35.0       NaN
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0    NaN       30.0       0.0
4  05 Feb 2021        NaN   40.0        NaN      -5.0
5  06 Feb 2021       35.0    NaN        NaN       NaN

In [ ]:
india.fillna(method = "ffill")

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0    NaN        NaN       0.0
1  02 Feb 2021       35.0   38.0       35.0       0.0
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0   35.0       30.0       0.0
4  05 Feb 2021       30.0   40.0       30.0      -5.0
5  06 Feb 2021       35.0   40.0       30.0      -5.0

In [ ]:
india

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0    NaN        NaN       0.0
1  02 Feb 2021        NaN   38.0       35.0       NaN
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0    NaN       30.0       0.0
4  05 Feb 2021        NaN   40.0        NaN      -5.0
5  06 Feb 2021       35.0    NaN        NaN       NaN

In [ ]:
a = india.fillna(method = "Bfill")

In [ ]:
a

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0   38.0       35.0       0.0
1  02 Feb 2021       38.0   38.0       35.0      -3.0
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0   40.0       30.0       0.0
4  05 Feb 2021       35.0   40.0        NaN      -5.0
5  06 Feb 2021       35.0    NaN        NaN       NaN

In [ ]:
a["Hyderabad"].mean()

35.166666666666664

In [ ]:
b = india.fillna({
    "Hyderabad" : india["Hyderabad"].mean(),
    "Delhi" : india["Delhi"].mean(),
    "Bangalore" : india["Bangalore"].mean(),
    "Srinagar" : india["Srinagar"].mean()

})

In [ ]:
b

          Date  Hyderabad      Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0  37.666667  31.666667       0.0
1  02 Feb 2021       34.5  38.000000  35.000000      -2.0
2  03 Feb 2021       38.0  35.000000  30.000000      -3.0
3  04 Feb 2021       30.0  37.666667  30.000000       0.0
4  05 Feb 2021       34.5  40.000000  31.666667      -5.0
5  06 Feb 2021       35.0  37.666667  31.666667      -2.0

In [ ]:
b["Hyderabad"].mean()

34.5

In [ ]:
india

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0    NaN        NaN       0.0
1  02 Feb 2021        NaN   38.0       35.0       NaN
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0    NaN       30.0       0.0
4  05 Feb 2021        NaN   40.0        NaN      -5.0
5  06 Feb 2021       35.0    NaN        NaN       NaN

In [ ]:
b

          Date  Hyderabad      Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0  37.666667  31.666667       0.0
1  02 Feb 2021       34.5  38.000000  35.000000      -2.0
2  03 Feb 2021       38.0  35.000000  30.000000      -3.0
3  04 Feb 2021       30.0  37.666667  30.000000       0.0
4  05 Feb 2021       34.5  40.000000  31.666667      -5.0
5  06 Feb 2021       35.0  37.666667  31.666667      -2.0

In [ ]:
b["Delhi"].mean()

37.666666666666664

In [ ]:
b["Bangalore"].mean()

31.666666666666668

In [ ]:
sdf = pd.read_csv("std.csv")

In [ ]:
sdf

     NAME  SEM1   SEM2   SEM3  SEM4
0    John    71     69  99999    72
1   Shiva    80  88888     81    85
2  Shanti    92     93     -1    89
3    Henk  3333     75     73    77
4  Franny    76     93     79  1111
5   Kumar    92     93     -5    89

In [ ]:
sdf.index = ["D11","D12","D13","D14","D15","D16"]

In [ ]:
sdf

       NAME  SEM1   SEM2   SEM3  SEM4
D11    John    71     69  99999    72
D12   Shiva    80  88888     81    85
D13  Shanti    92     93     -1    89
D14    Henk  3333     75     73    77
D15  Franny    76     93     79  1111
D16   Kumar    92     93     -5    89

In [ ]:
s2 = sdf.replace([99999,88888,-1,3333,1111,-5],np.nan)

In [ ]:
s1

       NAME  SEM1  SEM2  SEM3  SEM4
D11    John  71.0  69.0   NaN  72.0
D12   Shiva  80.0   NaN  81.0  85.0
D13  Shanti  92.0  93.0   NaN  89.0
D14    Henk   NaN  75.0  73.0  77.0
D15  Franny  76.0  93.0  79.0   NaN
D16   Kumar  92.0  93.0   NaN  89.0

In [ ]:
india

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0    NaN        NaN       0.0
1  02 Feb 2021        NaN   38.0       35.0       NaN
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0    NaN       30.0       0.0
4  05 Feb 2021        NaN   40.0        NaN      -5.0
5  06 Feb 2021       35.0    NaN        NaN       NaN

In [ ]:
india.fillna(method = "ffill")

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0    NaN        NaN       0.0
1  02 Feb 2021       35.0   38.0       35.0       0.0
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0   35.0       30.0       0.0
4  05 Feb 2021       30.0   40.0       30.0      -5.0
5  06 Feb 2021       35.0   40.0       30.0      -5.0

In [ ]:
india.fillna(method = "bfill")

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0   38.0       35.0       0.0
1  02 Feb 2021       38.0   38.0       35.0      -3.0
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0   40.0       30.0       0.0
4  05 Feb 2021       35.0   40.0        NaN      -5.0
5  06 Feb 2021       35.0    NaN        NaN       NaN

In [ ]:
s1

       NAME  SEM1  SEM2  SEM3  SEM4
D11    John  71.0  69.0   NaN  72.0
D12   Shiva  80.0   NaN  81.0  85.0
D13  Shanti  92.0  93.0   NaN  89.0
D14    Henk   NaN  75.0  73.0  77.0
D15  Franny  76.0  93.0  79.0   NaN
D16   Kumar  92.0  93.0   NaN  89.0

In [ ]:
s1.fillna(method = "ffill", axis = 1)

       NAME  SEM1 SEM2 SEM3 SEM4
D11    John    71   69   69   72
D12   Shiva    80   80   81   85
D13  Shanti    92   93   93   89
D14    Henk  Henk   75   73   77
D15  Franny    76   93   79   79
D16   Kumar    92   93   93   89

In [ ]:
s1 = s1.fillna(method = "bfill", axis = 1)

In [ ]:
s1 = s1.fillna(method = "ffill", axis = 1)

In [ ]:
s1

       NAME  SEM1  SEM2  SEM3  SEM4
D11    John  71.0  69.0  72.0  72.0
D12   Shiva  80.0  81.0  81.0  85.0
D13  Shanti  92.0  93.0  89.0  89.0
D14    Henk  75.0  75.0  73.0  77.0
D15  Franny  76.0  93.0  79.0  79.0
D16   Kumar  92.0  93.0  89.0  89.0

In [ ]:
india

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021       35.0    NaN        NaN       0.0
1  02 Feb 2021        NaN   38.0       35.0       NaN
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0    NaN       30.0       0.0
4  05 Feb 2021        NaN   40.0        NaN      -5.0
5  06 Feb 2021       35.0    NaN        NaN       NaN

In [ ]:
india.dropna()

          Date  Hyderabad  Delhi  Bangalore  Srinagar
2  03 Feb 2021       38.0   35.0       30.0      -3.0

In [ ]:
india.dropna(how = "any")

          Date  Hyderabad  Delhi  Bangalore  Srinagar
2  03 Feb 2021       38.0   35.0       30.0      -3.0

In [ ]:
s2

       NAME  SEM1  SEM2  SEM3  SEM4
D11    John  71.0  69.0   NaN  72.0
D12   Shiva  80.0   NaN  81.0  85.0
D13  Shanti  92.0  93.0   NaN  89.0
D14    Henk   NaN  75.0  73.0  77.0
D15  Franny  76.0  93.0  79.0   NaN
D16   Kumar  92.0  93.0   NaN  89.0

In [ ]:
ind1 = india.replace({"Hyderabad": 35},np.nan)

In [ ]:
ind1.dropna(how = "any")

          Date  Hyderabad  Delhi  Bangalore  Srinagar
2  03 Feb 2021       38.0   35.0       30.0      -3.0

In [ ]:
ind1

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021        NaN    NaN        NaN       0.0
1  02 Feb 2021        NaN   38.0       35.0       NaN
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0    NaN       30.0       0.0
4  05 Feb 2021        NaN   40.0        NaN      -5.0
5  06 Feb 2021        NaN    NaN        NaN       NaN

In [ ]:
ind1.dropna(how = "all")

          Date  Hyderabad  Delhi  Bangalore  Srinagar
0  01 Feb 2021        NaN    NaN        NaN       0.0
1  02 Feb 2021        NaN   38.0       35.0       NaN
2  03 Feb 2021       38.0   35.0       30.0      -3.0
3  04 Feb 2021       30.0    NaN       30.0       0.0
4  05 Feb 2021        NaN   40.0        NaN      -5.0
5  06 Feb 2021        NaN    NaN        NaN       NaN

In [ ]:
ind1 = ind1.set_index("Date")

In [ ]:
ind1

             Hyderabad  Delhi  Bangalore  Srinagar
Date
01 Feb 2021        NaN    NaN        NaN       0.0
02 Feb 2021        NaN   38.0       35.0       NaN
03 Feb 2021       38.0   35.0       30.0      -3.0
04 Feb 2021       30.0    NaN       30.0       0.0
05 Feb 2021        NaN   40.0        NaN      -5.0
06 Feb 2021        NaN    NaN        NaN       NaN

In [ ]:
ind1.dropna(how = "any")

             Hyderabad  Delhi  Bangalore  Srinagar
Date
03 Feb 2021       38.0   35.0       30.0      -3.0

In [ ]:
ind1.dropna(how = "all")

             Hyderabad  Delhi  Bangalore  Srinagar
Date
01 Feb 2021        NaN    NaN        NaN       0.0
02 Feb 2021        NaN   38.0       35.0       NaN
03 Feb 2021       38.0   35.0       30.0      -3.0
04 Feb 2021       30.0    NaN       30.0       0.0
05 Feb 2021        NaN   40.0        NaN      -5.0

In [ ]:
ind1

             Hyderabad  Delhi  Bangalore  Srinagar
Date
01 Feb 2021        NaN    NaN        NaN       0.0
02 Feb 2021        NaN   38.0       35.0       NaN
03 Feb 2021       38.0   35.0       30.0      -3.0
04 Feb 2021       30.0    NaN       30.0       0.0
05 Feb 2021        NaN   40.0        NaN      -5.0
06 Feb 2021        NaN    NaN        NaN       NaN

In [ ]:
ind1.dropna(thresh = 3)

             Hyderabad  Delhi  Bangalore  Srinagar
Date
03 Feb 2021       38.0   35.0       30.0      -3.0
04 Feb 2021       30.0    NaN       30.0       0.0

In [ ]:
ind1

             Hyderabad  Delhi  Bangalore  Srinagar
Date
01 Feb 2021        NaN    NaN        NaN       0.0
02 Feb 2021        NaN   38.0       35.0       NaN
03 Feb 2021       38.0   35.0       30.0      -3.0
04 Feb 2021       30.0    NaN       30.0       0.0
05 Feb 2021        NaN   40.0        NaN      -5.0
06 Feb 2021        NaN    NaN        NaN       NaN

In [ ]:
ind1.dropna(subset= ["Delhi"] )

             Hyderabad  Delhi  Bangalore  Srinagar
Date
02 Feb 2021        NaN   38.0       35.0       NaN
03 Feb 2021       38.0   35.0       30.0      -3.0
05 Feb 2021        NaN   40.0        NaN      -5.0

In [ ]:
ind1.dropna(subset = ["Srinagar"])

             Hyderabad  Delhi  Bangalore  Srinagar
Date
01 Feb 2021        NaN    NaN        NaN       0.0
03 Feb 2021       38.0   35.0       30.0      -3.0
04 Feb 2021       30.0    NaN       30.0       0.0
05 Feb 2021        NaN   40.0        NaN      -5.0

In [ ]:
ind1

             Hyderabad  Delhi  Bangalore  Srinagar  Chennai
Date
01 Feb 2021        NaN    NaN        NaN       0.0       45
02 Feb 2021        NaN   38.0       35.0       NaN       45
03 Feb 2021       38.0   35.0       30.0      -3.0       45
04 Feb 2021       30.0    NaN       30.0       0.0       45
05 Feb 2021        NaN   40.0        NaN      -5.0       45
06 Feb 2021        NaN    NaN        NaN       NaN       45

In [ ]:
ind1["Chennai"] = 45

In [ ]:
ind1.dropna(axis = 1,)

             Chennai
Date
01 Feb 2021       45
02 Feb 2021       45
03 Feb 2021       45
04 Feb 2021       45
05 Feb 2021       45
06 Feb 2021       45